{"meta":{"title":"Kots blog","subtitle":"Since 1993","description":"Everything Kots want to share","author":"Quan Hoang","url":"https://kuanhn.github.io","root":"/blog/"},"pages":[{"title":"About","date":"2018-01-27T14:47:58.000Z","updated":"2021-12-28T15:34:47.348Z","comments":true,"path":"About/index.html","permalink":"https://kuanhn.github.io/About/index.html","excerpt":"","text":"Để đây viết sau"}],"posts":[{"title":"Vài điều tự hỏi từ ngày biết đến Bitcoin (P2)","slug":"vai-dieu-tu-hoi-tu-ngay-biet-den-bitcoin-2","date":"2018-02-02T15:36:13.000Z","updated":"2021-12-28T15:34:47.348Z","comments":true,"path":"read/vai-dieu-tu-hoi-tu-ngay-biet-den-bitcoin-2/","link":"","permalink":"https://kuanhn.github.io/read/vai-dieu-tu-hoi-tu-ngay-biet-den-bitcoin-2/","excerpt":"","text":"Liệu Bitcoin có thể là nơi mình kiếm được tiền từ đó? Lần này mình sẽ mở đầu bằng câu hỏi mà hiện tại khi viết bài viết này mình vẫn chưa thể tự trả lời được. Trước những biến động gần đây thì có thể thấy những người 3 tháng trước vỗ ngực mình đã trở thành triệu phú đô la thì giờ đây lại trở về vạch xuất phát nhưng cũng không thể biết được 3 tháng sau họ sẽ như thế nào. Thôi thay vì bận tâm vào những điều không thể đoán trước được thì mình lại dành thời gian để tìm hiểu những điều mà người ta đã biết từ trước vậy. Nếu vô tình bạn cũng có hứng thú muốn tìm hiểu thì có thể tham khảo bài viết trước của mình ở đây. Bitcoin là gì?Về cơ bản thì bitcoin cũng giống như ScroogeCoin nghĩa là cũng được xây dựng trên công nghệ blockchain và các đặc tính về một giao dịch cũng như vậy. Nhưng điều khác ở đây là “xã hội” này không tồn tại một cá thể duy nhất để đảm bảo tính ổn định của nó. Một mạng lưới các nút ngang hàng (peer-to-peer) sẽ đảm nhận điều đó. Bitcoin toàn cầu điều phối và ổn định các giao dịch bằng thuật toán. Để trả lời câu hỏi Bitcoin là gì? thì quả thật nếu chỉ đọc những dòng định nghĩa trên Wikipedia thì thật sự không thỏa mãn lắm. Bitcoin (ký hiệu: BTC, XBT) là một loại tiền mã hóa, được phát minh bởi Satoshi Nakamoto dưới dạng phần mềm mã nguồn mở từ năm 2009. Bitcoin có thể được trao đổi trực tiếp bằng thiết bị kết nối Internet mà không cần thông qua một tổ chức tài chính trung gian nào. Không tồn tại nhà điều hành trung ương thì thì các thuật toán và các nút sẽ vận hành mạng lưới này như thế nào? Đó là câu hỏi tiếp theo xuất hiện khi mình mình muốn tự tìm hiểu để có chút tự tin khi nói với ai đó về bitcoin. Có thể chia nhỏ ra để trả lời các câu hỏi như sau: Ai duy trì các giao dịch? Ai có thẩm quyền quyết định giao dịch nào hợp lệ? Ai tạo ra bitcoins mới? Ai thay đổi cách thay đổi các quy tắc của hệ thống? Làm thế nào để bitcoins có được giá trị trao đổi? Một block của bitcoin sẽ như thế nào?Như đã nói bitcoin được xây dựng dựa trên công nghệ blockchain nên thôi cứ bắt đầu từ đơn vị nhỏ nhất là một block xem nó như thế nào. Dưới đây là hình ảnh mô tả blockchain của bitcoin. Ở đó chuỗi chính (màu vàng) bao gồm chuỗi block dài nhất tính từ block khởi đầu (genesis). Block màu đen không được chấp nhận do không đạt sự đồng thuận của mạng lưới. Còn về chi tiết một block sẽ có những phần như sau: Magic number (4 bytes): Đây là một số nhận diện cho mạng Blockchain do đó có giá trị không đổi là 0xD9B4BEF9. Nó chỉ ra điểm Khởi đầu của block và Dữ liệu từ mạng lưới sản xuất. Block size (4 bytes): Cho biết kích thước của block là bao nhiêu. Kể từ khi bắt đầu cho đến ngày hôm nay mỗi block được cố định tối đa 1 MB. Version (4 bytes): Mỗi nút chạy giao thức Bitcoin phải thực hiện cùng một phiên bản và đây là trường xác định phiên bản đó. Previous block hash (32 bytes): Kết quả hash của header trong block trước đó. Nó được tính bằng cách dùng mã hóa SHA-256 tất cả các trường của header như version, nonce v..vv Merkle Root (32 bytes), Timestamp (4 bytes), Difficulty Target (4 bytes), Nonce (4 bytes): Những giá trị này định nghĩa thì mất thời gian nên sẽ nói ở những mục phía dưới. Tất cả các trường vừa rồi sẽ quy định header của một block. Còn lại Transaction Counter (1–9 bytes) : ghi lại số lượng các giao dịch được ghi trong block Transaction List (Tối đa 1MB): Danh sách các giao dịch. Đây là block đầu tiên của Bitcoin và block gần nhất của Bitcoin trong thời điểm mình viết bài này. Merkle Root là gì?Như đã nói thì mỗi block có một danh sách tóm tắt của tất cả các giao dịch. Một khi block là một phần của blockchain thì nội dung của nó khó có thể thay đổi hoặc có thể nói là không thể. Các giao dịch được liệt kê như cây merkle (cây băm nhị phân). Mỗi lá sẽ là một giao dịch và sẽ được thực hiện và xác nhận như mình đã nói ở phần trước trong mục Transactions. Sau đó mỗi giao dịch này sẽ được hash lại bằng mã hóa SHA256 hai lần nghĩa là Hash [Tx3] = SHA256 (SHA256 (Tx3)).Tương tự như vậy để xây dựng một nút cha Hash(23) 32 byte Hash [Tx2] và 32 byte Hash [Tx3] được ghép nối như là một chuỗi hash 64 byte và sau đó SHA256 được áp dụng hai lần để cho ra một Hash 32 byte. Gốc cây là nút trên là hash của tất cả.Định nghĩa là như vậy nhưng mục đích của nó là gì thì phải xét đến việc xác nhận giao dịch. Thông qua kết quả hash của gốc rất dễ dàng để xác định liệu một giao dịch cụ thể có nằm trong block hay không. Timestamp ư? Tại sao lại có thời gian ở đây?Tiếp theo là một khái niệm nữa trong cấu trúc của một block. Lặp lại về vấn đề double-spend ở bài trước, ở mạng lưới bitcoin thì vấn đề này cũng phải được giải quyết. Nghĩa là cần một giải pháp làm sao để người nhận biết rằng người bán đã không “ký” lên một giao dịch nào trước đó. Và ý tưởng ở đây được đưa ra là giao dịch sớm nhất là giao dịch được chấp nhận không cần quan tâm sau có trường hợp double-spend xảy ra hay không. Và cách duy nhất để xác minh điều đó là tất cả các giao dịch cần được công khai. Những nút trong mạng lưới sẽ biểu quyết (vote) để công nhận một lịch sử giao dịch duy nhất. Một người nhận hợp pháp khi anh ta có thể chứng minh rằng giao dịch nơi mình nhận được là giao dịch sớm nhất trong chuỗi lịch sử giao dịch được cộng đồng công nhận này. Và khi đó sẽ giải quyết được vấn đề nếu có sự gian lận xảy ra ở đây. Người nhận thứ hai có thể dựa vào danh sách tất cả các giao dịch để phát hiện gian lận. Trong trường hợp người gửi không chứng minh được sự sở hữu của tài sản do đó không phải là giao dịch đầu tiên với tài sản này thì cũng chẳng thế thực hiện được giao dịch nào tiếp theo cả. Timestamp được đưa ra ở đây là để thực hiện việc xác minh thời gian đó. Tất nhiên giá trị này cũng được hash và giá trị tiếp theo sẽ bao giá trị thời gian của những block trước đó như đặc tính của blockchain khi đó nó sẽ không thể bị giả mạo. Network ở đây là gì?Tất nhiên ở đây không chỉ nói network là mạng lưới, từ khi tìm hiểu mình cũng chỉ biết dưới tên mạng lưới ngang hàng (peer-to-peer network) là tính chất của mạng lưới bitcoin. Thế nhưng mạng lưới này hoạt động như thế nào mà mọi khái niệm vừa rồi đều thấy nhắc đến.Mạng lưới của bitcoin được Satoshi giới thiệu sẽ vận hành theo các bước sau. Các giao dịch mới được công khai tới tất cả các nút. Mỗi nút thu thập các giao dịch mới vào một block. Mỗi nút thực hiện việc tìm kiếm một giá trị chứng minh proof-of-work của block đó. Khi một nút tìm thấy giá trị chứng minh trên nó công khai block cho tất cả các nút. Các nút khác chấp nhận block chỉ khi tất cả các giao dịch trong đó là hợp lệ và chưa được chi tiêu. Các nút thể hiện sự chấp nhận của block này bằng cách tạo ra block tiếp theo trong chuỗi và gắn hash của block được chấp nhận trước đó. Đến đây thì có thể hiểu ra được phần nào câu trả lời cho những câu hỏi như Ai duy trì các giao dịch? Ai có thẩm quyền quyết định giao dịch nào hợp lệ? Ai thay đổi cách thay đổi các quy tắc của hệ thống? Tất cả đều do các nút trong mạng lưới quyết định, mỗi một nút sẽ có một quyền vote các hoạt động của mạng lưới. Vậy việc vote này sẽ thực hiện như thế nào, chẳng nhẽ có một cái “hòm” thống kê rồi mỗi nút sẽ “bỏ phiếu” vào đó. Nếu như vậy thì thủ công quá, vote ở đây có thể dễ hình dung qua một ví dụ về trường hợp có hai nút công khai một block cùng một lúc. Tất nhiên lúc này sẽ có khả năng tạo ra hai nhánh ứng với nút cuối là hai block này, các nút sẽ lại bắt đầu thực hiện công việc tìm kiếm trên block đầu tiên mà nút đó nhận được, hoặc cũng có thể là block sau. Chỉ đến khi công việc ở một trong hai block được hoàn thành trước và nhánh chứa block đó trở nên dài hơn khi đó nhánh còn lại đương nhiên bị hủy bỏ. Một cách thông thường thì những nhánh có nhiều nút làm việc hơn tất nhiên sẽ đưa ra được kết quả nhanh hơn rồi. Đó chính là kết quả của việc vote, mỗi nút sẽ quyết định chọn nhánh và block của nhánh để làm việc và lựa chọn của đa số sẽ được quyết định. Proof-of-work ở đây là gì?Tiếp theo còn một câu hỏi bị bỏ lửng ở giữa 3. Ai tạo ra bitcoins mới? hay 5. Làm thế nào để bitcoins có được giá trị trao đổi? Mấu chốt để trả lời câu hỏi này sẽ nằm ở bước 3 và 4 trong sự hoạt động của network và đây cũng chính từ đây có thể miêu tả về công việc đào coin mà lần đầu mình đã nhắc đến. Proof-of-work hay bằng chứng công việc là một cách để thể hiện sự khó khăn để kiếm ra được bitcoin bởi vì để thực hiện công việc này cần tốn thời gian và tiền bạc. Để có thể được cả mạng lưới chấp nhận, block mới cần phải chứa giá trị Proof-of-work. Proof-of-work yêu cầu mỗi nút tìm kiếm một số nonce, mà khi nội dung của block được hash cùng nonce, kết quả tạo ra một số nhỏ hơn số target của mạng lưới (số target càng nhỏ thì độ khó càng cao). Nói cách khác: Proof-of-work rất dễ cho các máy tính xác nhận, nhưng cực kỳ mất nhiều thời gian để có thể tạo ra. Các nút phải thử rất nhiều giá trị nonce khác nhau trước khi đạt được độ khó mà mạng lưới yêu cầu. Tại thời điểm khi viết bài viết này dựa theo số tiền điện để vận hành các nút thì chi phí cho việc kiếm được một bitcoin vào khoảng 5040$. Tại sao lại có sự yêu cầu khó khăn này? Đó là bởi vì khi mỗi block được đưa nối vào chuỗi thì nút đã thực hiện công việc trên block đó sẽ nhận được 12,5 bitcoin và toàn bộ phí giao dịch được viết trong block này. Máy tính có hiện đại thì việc thực hiện hàng triệu phép toán mỗi giây không phải là điều gì đó khó khăn nữa. Sự khó khăn được đưa ra để đảm bảo sự giãn cách khoảng 10 phút mới có một block được công khai. Cũng như những quy định cứ 2016 block được công khai thì độ khó sẽ lại thay đổi, 210.000 block được thêm vào thì phần thưởng sẽ giảm một nửa. Chính dựa vào sự khó khăn rồi khan hiếm dần theo thời gian sẽ tạo nên giá trị trao đổi cho bitcoin. Tất nhiên độ khó cũng sẽ có thể tăng hoặc giảm tùy theo vote của cả hệ thống. Để “thích nghi” được với sự khó khăn này thì các nút riêng lẻ sẽ tập hợp lại với nhau để cùng làm công việc trên mỗi một block. Sự tập hợp này được gọi thành các bể đào (pools). Điều này sẽ giúp gia tăng khả năng có được kiếm được bitcoin khi mà sức mạng của các máy tính riêng lẻ được tập hợp lại. Tất nhiên sau đó thành quả sẽ được chia sẻ theo công đóng góp mà chủ yếu dựa vào số phép thử hash mà mỗi nút thành viên đã thực hiện. Difficulty và Target?Đến đây thì cũng đã tìm hiểu được hầu hết những thứ cơ bản về bitcoin rồi nhưng tò thêm về hai thuật ngữ quyết định độ khó vừa được nhắc tới Difficulty và Target nên lại voọc wiki thêm một chút nữa.Target là một số 256-bit mà tất cả các nút công nhận. Hash SHA-256 của block header phải nhỏ hơn hoặc bằng target hiện tại của block để được chấp nhận bởi mạng. Target càng thấp, càng khó tạo block.Difficulty dùng để đo mức độ khó khăn được tìm được một giá trị hash mà nhỏ hơn target nhất định. Toàn bộ mạng lưới sẽ có chung một giá trị difficulty tuy nhiên khi tham gia vào các bể đào thì độ khó này cũng có thể bị thay đổi do có thêm việc tính toán chia thành quả sau này. Kiếm khó khăn như vậy nhưng để mất bitcoin thì sao?Vì có những tính chất của tiền tệ: Đáng giá, lưu thông, dự trữ, thanh toán nên bitcoin đang trở thành tài sản của thế hệ mới với nhiều đặc điểm vượt trội như: Không cần trung gian thanh toán nên giảm thiểu chi phí. Không thể tự làm ra hoặc làm giả. Hơn nưa không mất chi phí giám định như với các tài sản như vàng. Dễ dàng chia nhỏ và thanh toán. Bảo vệ môi trường. Nếu như vậy thì có vẻ bitcoin là loại tiền tệ rất đáng để lưu trữ. Vậy lưu trữ bitcoin như thế nào?Mỗi tài khoản Bitcoin được biểu diễn dưới dạng một ví Bitcoin. Mỗi ví Bitcoin bao gồm địa chỉ Bitcoin công khai (hash của public key) và khóa bí mật (private key). Một địa chỉ có 160 bit dữ liệu, vì vậy có thể tạo ra tổng cộng $2^{160}$ địa chỉ Bitcoin - tương đương $10^{48}$ địa chỉ. Ngoài ra địa chỉ còn bao gồm 4 byte checksum nên xác suất mạng lưới chấp nhận địa chỉ Bitcoin gõ sai cực kỳ thấp. Bất kỳ ai cũng có thể gửi Bitcoin đến một chiếc ví bằng địa chỉ công khai, còn khoá bí mật phải được nhập khi chủ ví muốn gửi Bitcoin đi. Vì vậy, việc sở hữu Bitcoin được định nghĩa là sự nắm giữ khoá bí mật của một địa chỉ Bitcoin. Giao dịch mọi thứ đều dễ dàng như vậy nhưng nếu đánh mất khóa bí mật cũng đồng nghĩa với việc bitcoin trong đó sẽ mất hay có thể hiểu khó mà có thể chi tiêu được nữa. Tại sao mình lại dùng từ “khó” bởi vì việc lấy lại khóa bí mật sau khi sinh ra là không có nhưng có thể dùng phương pháp vét cạn để tìm lại. :D Vấn đề của mạng lưới bitcoin?Trong khi tất cả các mọi thứ về blockchain còn nằm trong ý tưởng thì Bitcoin đã trở thành tiên phong của công nghệ này khi được thử nghiệm theo thời gian và được hàng triệu người sử dụng. Tuy vậy mạng lưới bitcoin vẫn không phải là hoàn hảo và nó vẫn còn những vấn đề tiềm ẩn.TẤN CÔNG 51% là cách mà người ta nhận định về vấn đề của mạng lưới bitcoin. Khi một nút hay một pools có khả năng kiểm soát 51% sức mạnh máy tính của cả hệ thống. Lúc này việc tạo ra những gian lận, hoặc hủy bỏ những block hợp lệ là điều có thể xảy ra. Mặc dù hiện nay thì điều này vẫn chỉ nằm trong lý thuyết nhưng đó cũng là lý do để những công nghệ mới hơn được nghiên cứu cải tiến và đưa ra thực hiện. Ethereum là câu trả lời cho việc đó.","categories":[{"name":"Read","slug":"read","permalink":"https://kuanhn.github.io/categories/read/"}],"tags":[{"name":"blockchain","slug":"blockchain","permalink":"https://kuanhn.github.io/tags/blockchain/"},{"name":"cryptocurrencies","slug":"cryptocurrencies","permalink":"https://kuanhn.github.io/tags/cryptocurrencies/"},{"name":"bitcoin","slug":"bitcoin","permalink":"https://kuanhn.github.io/tags/bitcoin/"}]},{"title":"Vài điều tự hỏi từ ngày biết đến Bitcoin (P1)","slug":"vai-dieu-tu-hoi-tu-ngay-biet-den-bitcoin-1","date":"2018-01-31T15:20:52.000Z","updated":"2021-12-28T15:34:47.348Z","comments":true,"path":"read/vai-dieu-tu-hoi-tu-ngay-biet-den-bitcoin-1/","link":"","permalink":"https://kuanhn.github.io/read/vai-dieu-tu-hoi-tu-ngay-biet-den-bitcoin-1/","excerpt":"","text":"Tản mạn Đứng dưới cái tiết trời 3ºC nhìn ngắm nguyệt thực toàn phần âu cũng làm con người ta dễ hoài niệm. Cái tâm trạng đó cũng dễ khiến người ta chỉ cần nhìn vào cái biểu đồ nến thôi cũng gợi nhớ về bao chuyện từ hồi chân ướt chân ráo bước vào tìm hiểu Bitcoin. Đấy là kiểu mấy ông nhà văn xàm xàm hay viết chứ thật ra cũng chỉ là mình muốn ghi chép lại mấy điều ngày xưa từng thắc mắc rồi tìm hiểu ra thôi. Về cơ bản thì cứ tìm hiểu lại thấy cái không hiểu nên lại phải xem lại. Nhưng dưới đây mình sẽ tổng hợp theo luồng suy nghĩ mình nghĩ là đơn giản nhất để sau này nếu có chia sẻ cho ai cũng dễ để biết bắt đầu từ đâu. Các vấn đề nối nhau xuất hiệnAnh em có tậu con trâu điện về kiếm tiền không?Không phải là câu hỏi của mình nhưng đó chính là sự khởi đầu của tất cả các câu hỏi phía sau đây của mình. Sau hai ba câu chat mình mới biết là nó rủ mình đào coin vì đó đang là trend lúc bấy giờ. Và sau cuộc nói chuyện đó mình chỉ biết công việc sẽ được mô tả như thế này: Build một con trâu điện với 6 card đồ hoạ rồi chui vào một mỏ (pools) để làm công việc là “niêm phong” (hash) từng trang (block) của một cuốn sổ chứa nội dung là chính những giao dịch của một đồng coin rồi nhận phần thưởng trích ra từ phí của chính những giao dịch được ghi lại trong trang đó. Mặc dù tài ăn nói sử dụng tiếng Việt của mình cũng tạm nhưng mà nghĩ chắc mà đi giải thích được cái này cho người khác chắc cũng méo mồm. Tại sao nó không nói theo kiểu là mình dùng máy tính để làm công việc như một nhân viên ngân hàng, kiểm tra các giao dịch rồi nhận lương chính là phần trích ra từ phí phát sinh của những giao dịch đó cho nhanh?Chính vì trong lời giải thích phải dùng cách mô tả mà bên trong đó đã xuất hiện bao nhiêu từ khoá để phải tra trên Google, cộng thêm đây có vẻ là một công nghệ mới nên quyết định tìm hiểu từ đầu cho đỡ bứt rứt. Hash là gì?Thằng bạn mình nó dùng từ này và gọi nó là công việc. Cũng may là hồi học đại học đã được học rồi nên mới thấy quen quen nhưng lại không thể nhớ hết tính chất của nó nên tìm hiểu lại. Hoá ra sau này mới rõ đây lại chính là điều mà mọi tài liệu mình tìm hiểu về blockchain đều nói tới đầu tiên. Một Cryptographic Hash Functions hay còn gọi là hàm băm mật mã là một hàm số toán học mà qua đó một dữ liệu có độ dài bất kì sẽ biến thành một chuỗi có độ dài cố định. Khi tính giá trị của hàm hash trên một chuỗi n-bit thì độ phức tạp của thuật toán là O(n).Ví dụ điển hình là SHA-256 một trong họ hàm hash SHA-2 được thiết kế bởi NSA. Khi tìm hiểu đến đây thì có vẻ đều là kiến thức đã được học nên mình không thấy có gì lạ lẫm cả, có chăng thì chỉ tra lại viết tắt của NSA (National Security Agency). Hàm hash có vai trò gì?Nhớ lại lúc học về hash thì được dạy nó có những tính chất như này: Collision-resistance không thể tìm hai đầu vào $x$ và $y$ để cho $H(x) = H(y)$ Hiding one-way không thể tìm được đầu vào $x$ nếu biết được $y$ là kết quả của hàm $H(x)$ Puzzle-friendliness không thể tìm được giá trị $x$ để $H(k || x) = y$ trong thời gian ít hơn $2^n$ nếu cho trước giá trị $y$ và giá trị ngẫu nhiên $k$ Với mấy tính chất đó thì luôn đi kèm với mấy ví dụ ứng dụng như là Message digests hoặc là Commitment scheme hồi trên giảng đường. Block là gì?Khi xem lại hết mấy cái ví dụ về hash vẫn chưa thấy sự liên quan ở đây nên mình chuyển vấn đề tìm hiểu sang block. Sau chỉ một lần tìm kiếm Google cũng đã nhanh chóng có được câu trả lời như sau trên Wikipedia. Mọi dữ liệu trên mạng Internet đều rất dễ dàng bị sao chép, mỗi giao dịch Bitcoin cũng chỉ là một khối (block) thông tin. Bình thường, khi giao dịch trực tuyến, chúng ta sẽ cần đến một bên trung gian thứ ba mà chúng ta tin tưởng (ví dụ: công ty Paypal, công ty Ngân Lượng, Ngân hàng Vietcombank,…) với một cơ sở dữ liệu tập trung để xác minh giao dịch nhằm chống gian lận khi kẻ gian sử dụng lại khối thông tin này nhiều lần. Công nghệ blockchain đã giải quyết được bài toán này (double-spending) mà không cần tới bên trung gian thứ ba tin cậy. Blockchain là một cuốn sổ cái ghi lại tất cả các giao dịch. BlockchainWikipedia Không tìm thì thôi tìm thì lại thấy xuất hiện bao nhiêu là từ khoá mới để tìm hiểu. Thôi cứ từ từ bóc tách từng thằng một đọc xem sao. Blockchain là gì?Khi tìm hiểu tới đây thì mọi đường dẫn đều nói đến Bitcoin thoạt đầu còn nghĩ blockchain là một khái niệm được định nghĩa bên trong Bitcoin. Sau hai ba trang đều có cái mở đầu giống nhau được phát minh bởi Satoshi Nakamoto dưới dạng phần mềm mã nguồn mở từ năm 2009 thì mình quyết định tìm luôn cái phát minh đấy để đọc xem nó như thế nào. Và mình tìm thấy paper Bitcoin: A Peer-to-Peer Electronic Cash System trong vài kết quả search.Tại đây mình lại nhìn thấy hash \u001dnhưng được sử dụng trong con trỏ trỏ tới những block liền kề và cứ thế một cách liên tiếp nhau theo một chuỗi (chain) những giao dịch (transactions). Một cách dễ hình dung hơn thì ở một tài liệu khác mô hình giao dịch được giới thiệu như sau: Một con trỏ hash có kèm theo giá trị hash của nội dung được trỏ tới. Khi sử dụng con trỏ hash thay cho con trỏ trong việc xây dựng cấu trúc dữ liệu linked list thì ta sẽ có cấu trúc mới được gọi là blockchain. Ra là thế giờ thì đã biết cái định nghĩa của blockchain. Hoá ra ở mỗi khối sẽ không chỉ trỏ tới khối trước đó như ở linked list mà còn lưu giá trị hash của khối được trỏ tới. Nếu dùng giá trị hash này ta có thể kiểm tra nội dung của khối được trỏ tới có toàn vẹn hay không. Và cứ thế nếu ta biết được giá trị hash ở cuối một chuỗi ta có thể xác định được nội dung của cả blockchain có bị thay đổi hay không. Transactions đã được Satoshi giới thiệu ứng dụng blockchain như thế nào?Đây là hình ảnh được Satoshi mô tả trong paper: Một đồng tiền điện tử được định nghĩa như một chuỗi của những giao dịch của những chữ kí điện tử. Một người chuyển coin cho một người khác bằng cách ký lên hash của block giao dịch trước đó và gắn khoá công khai của người nhận vào cuối của đồng coin. Người nhận có thể xác nhận chữ ký để chứng minh sự sở hữu của mình. Đoạn trên mình dịch ra trong paper của Satoshi, ta thấy ở đây mô hình blockchain này có thêm khái niệm (digital signature). Nhắc đến nó thì lại cần đọc lại về ba thuật toán này. $(s_k,p_k) := generateKeys(keysize)$ Hàm tạo ra một cặp khoá: khoá công khai và một khoá bí mật. Tất nhiên như cái tên thì khoá bí mật $s_k$ thì chỉ mình biết, còn khoá công khai $p_k$ sẽ chia sẻ với với mọi người. $sig := sign(s_k, message)$ Với khoá bí mật $s_k$ ta sẽ sử dụng để tạo ra chữ ký xác nhận cho message. $sValid := verify(p_k, message, sig)$ Xác nhận chữ ký với khoá công khai $s_k$ giá trị trả về là true nếu sig đúng là chữ ký được tạo ra bởi khoá bí mật tương ứng $s_k$ và ngược lại sẽ là false. Quay lại với mô hình của Satoshi, lúc này trong một giao dịch chuyển tiền giữa Owner1 và Owner2 thì: Owner1 sẽ ký lên mã hash của khối giao dịch trước đó (lần mà Owner1 là người nhận) cùng với việc thêm vào địa chỉ người nhận TO: khoá công khai của Owner2. Owner2 lúc này sẽ dùng khoá công khai của Owner1,hash và chữ ký để xác nhận về tính đúng đúng đắn của giao dịch. Thật ra mình đọc đến đây cũng phải mất rất lâu để thẩm (thấu) được cái hình đó. Không phải do sự khó hiểu của sự xác nhận bằng chữ ký điện tử mà là sự xác định sở hữu và giá trị của giao dịch làm mình mông lung. Lúc đó mình tự đặt những câu hỏi kiểu như: Tại sao việc xác nhận được giao dịch trước thì lại tính là được sở hữu?Để đơn giản nhất cứ nghĩ tới bước đầu tiên, bạn giao dịch với cơ quan phát hành tiền tệ là Ngân hàng nhà nước X chẳng hạn. Nếu bạn xác nhận đúng đó là đồng tiền của nơi mà cả xã hội đang công nhận thì đó có thể được coi đang nắm giữ một giá trị trong xã hội. Tất nhiên ở những giao dịch sau đó những người khác đều xác nhận được đồng tiền không bị thay đổi trong chuỗi giao dịch trước đó thì giá trị của tài sản này vẫn được đảm bảo. Nếu ví dụ có sự gian lận, người gửi giả mạo giá trị trong lần giao dịch trước để thay đổi quyền sở hữu thì sao? Lúc đó giao dịch không thành công và cả chuỗi sẽ dừng lại à?Nếu đọc lại về blockchain và về con trỏ hash thì thấy rằng việc thay đổi nội dung giao dịch sẽ bị phát hiện bởi giá trị hash sẽ thay đổi. Khi này nếu như có sự giả mạo thì giao dịch sẽ thất bại, tất nhiên khi đó các giá trị tài sản trao đổi sẽ không mất đi đâu cả chỉ là chẳng có gì được trao đổi hết mà mọi thứ vẫn nằm ở túi của cả hai bên. Còn về chuỗi nó vẫn sẽ tiếp diễn khi người sở hữu thực sự ở block cuối tiến hành một giao dịch. Ví dụ về một đồng tiền thuật toán (Cryptocurrency)?Thấm xong được hai mục đầu của cái payper thì mình mới tìm được một ví dụ đơn nhất về đồng tiền thuật toán với tên gọi GoofyCoin. Giả định Goofy có thể tạo ra đồng xu mới với một tuyên bố rằng ông ta làm ra một đồng xu mới với ID duy nhất. Và sau đó bất cứ ai sở hữu một đồng tiền có thể chuyển nó cho người khác bằng cách ký một tuyên bố nói rằng : “chuyển tiền xu này cho người X”. Những người nhận hoàn toàn có thể xác minh tính hợp lệ của đồng xu bằng cách đơn giản theo chuỗi và xác minh tất cả các chữ ký trên đường đi. Double-spending là gì?Nhưng đồng coin Goofy này là tồn tại một vấn đề mang tên double-spending, chính xác là cái vấn đề mà wiki nhắc đến hồi mới tìm hiểu. Mình cũng chưa biết là gì nên tìm định nghĩa luôn. Double-spending là hình thức gian lận hai giao dịch khác nhau để cùng chi tiêu một số dư. Ban đầu khi đọc mình chưa hiểu được vì sao số dư lại chi tiêu được hai giao dịch. Sau đó mới ngộ ra trong cuộc sống cần phải có ngân hàng để như là bên thứ ba giữa những cuộc giao dịch là như vậy, vì đó là bên đảm bảo điều gian lận kia không xảy ra được. Vậy xem ở xã hội không có ngân hàng của Goofy thì sự gian lận xảy ra như thế nào. Nó sẽ diễn ra như sau: Goofy tạo một giao dịch với Alice. Alice tạo một giao dịch với Bob. Sau đó Alice tiếp tục tạo một giao dịch với Chuck cùng một giá trị. Tất nhiên sau đó cả Bob và Chuck đều có thực hiện những công việc xác nhận thành công. Lúc đó sẽ phát sinh việc một đồng coin lại có thể thực hiện cả hai giao dịch. Công nghệ blockchain đã giải quyết được bài toán double-spending như thế nào?Học theo xã hội của Goofy, Scrooge cũng muốn tạo một đồng coin của riêng mình. Do vì hiểu được vấn đề của gian lận double-spending có thể xảy ra nên Scorooge có ý tưởng đưa lịch sử của tất cả các giao dịch vào blockchain rồi ký xác nhận lên đó. Về cơ bản việc giao dịch vẫn giống như ở xã hội của Goofy chỉ khác sau mỗi giao dịch ở đây đại diện Scorooge sẽ lấy con trỏ hash và ký xác nhận lên đó rồi thông báo cho tất cả mọi người. Tất nhiên là mọi người trong xã hội của Scorooge đều có thể dùng khoá công khai để xác nhận rằng con trỏ hash này chính là cái đã được chính Scorooge xác thực hay không. Và vẫn như đã nói ở trên, khi biết được con trỏ hash này thì ai cũng có thể dò theo cả chuỗi để xem lịch sử của tất cả các giao dịch. Chính lịch sử giao dịch công khai là điều sẽ đảm bảo không có gian lận xảy ra. Quay lại với kịch bản của xã hội của Goofy, Alice thực hiện thanh toán cho cả Bob và Chuck. Chuck hoàn toàn có thể đối chiếu vào lịch sử giao dịch để thấy rằng Alice đã có giao dịch trước đó với Bob và từ chối giao dịch của Alice. Có thể lúc này bạn sẽ nghĩ rằng vấn đề hoàn toàn phụ thuộc vào Scorooge, vậy khi mà ông ta không làm tốt công việc của mình thì sao. Tất nhiên là không có gì để đảm bảo là Scorooge sẽ không có sai lầm và khi đó khả năng phát sinh ra vấn đề là có thể xảy ra. Cũng nên hiểu Scorooge như là một nhà phát hành tiền, một khi Scorooge làm cho đồng tiền của mình không còn đáng tin cậy thì cũng chẳng có ai sử dụng nó nữa và điều đó thì chẳng ai mong muốn cả. Vấn đề dễ sụp đổ này được giải quyết ra sao? Rồi các giải pháp đó có lỗ hổng gì không? Sau đó lại được cải tiến như thế nào? Cứ theo những câu hỏi như vậy mình đã ngộ thêm ra điều gì? Điều này sẽ còn chia sẻ ở bài sắp tới…Áp dụng vào Bitcoin ra sao?","categories":[{"name":"Read","slug":"read","permalink":"https://kuanhn.github.io/categories/read/"}],"tags":[{"name":"blockchain","slug":"blockchain","permalink":"https://kuanhn.github.io/tags/blockchain/"},{"name":"cryptocurrencies","slug":"cryptocurrencies","permalink":"https://kuanhn.github.io/tags/cryptocurrencies/"}]}],"categories":[{"name":"Read","slug":"read","permalink":"https://kuanhn.github.io/categories/read/"}],"tags":[{"name":"blockchain","slug":"blockchain","permalink":"https://kuanhn.github.io/tags/blockchain/"},{"name":"cryptocurrencies","slug":"cryptocurrencies","permalink":"https://kuanhn.github.io/tags/cryptocurrencies/"},{"name":"bitcoin","slug":"bitcoin","permalink":"https://kuanhn.github.io/tags/bitcoin/"}]}